tsung/data/horisontal-scaling/4-xlarge/20161201-1627/complete.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="Messi-Coders-4-xlarge-947776554.us-west-2.elb.amazonaws.com" port="80" type="tcp"/>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
   <arrivalphase phase="4" duration="30" unit="second">
     <users arrivalrate="8" unit="second"/>
   </arrivalphase>
   </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
 

    <session name="complete-test" probability="100" type="ts_http">

      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>
      <setdynvars sourcetype="random_number" start="1" end="5">
        <var name="random_tournament_number"/>
      </setdynvars>

      <setdynvars sourcetype="random_number" start="42" end="89">
        <var name="random_match_number"/>
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="10">
        <var name="random_club_number"/>
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="200">
        <var name="random_player_number"/>
      </setdynvars>
      <request subst="true">
        <http url="/tournaments/%%_random_tournament_number%%" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/matches/%%_random_match_number%%" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/clubs/%%_random_club_number%%" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/players/%%_random_player_number%%" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>
      <request>
        <http url="/players?utf8=%E2%9C%93&amp;search=Julie&amp;commit=Search" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>
      <request>
        <http url="/news" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http url="/news/new" version="1.1" method="GET"/>
      </request>

      <thinktime value="10" random="true"/>
      
      <request subst="true">
        <dyn_variable name="created_news_url" re="[Ll]ocation: (http://.*)\r"/>
        <dyn_variable name="created_news_id" re="[Ll]ocation: http://.*/news/(.*)\r"/>
        <http url="/news" version="1.1" method="POST" contents="news%5Bnewslink%5D=wef&amp;news%5Btitle%5D=awef&amp;news%5Bsubtext%5D=awef&amp;news%5Bimglink%5D=awef&amp;commit=Create+News"/>
      </request>

      <request subst="true">
        <http url="/news/%%_created_news_id%%/edit" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/news/%%_created_news_id%%" version="1.1" method="PATCH" contents="news%5Bnewslink%5D=newlink&amp;news%5Btitle%5D=NewTitle&amp;news%5Bsubtext%5D=Why&amp;news%5Bimglink%5D=Newimagelink&amp;commit=Update+News"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/news/%%_created_news_id%%" version="1.1" method="DELETE"/>
      </request>
      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->         io:format([126, $p, 126, $n, 126, $n], [DynVars]),         ok end.">
        <var name="dump"/>
      </setdynvars>

    </session>

  </sessions>
</tsung>